# CheckConstructionSetElement Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyDataSettings..::..CheckConstructionSetElement Method
EnergyDataSettings Class See Also
---
Checks that the construction set ElementId is acceptable.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool CheckConstructionSetElement(
	ElementId constructionSetElementId
)
```

Visual Basic
---
```text
Public Function CheckConstructionSetElement ( _
	constructionSetElementId As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
bool CheckConstructionSetElement(
	ElementId^ constructionSetElementId
)
```

# ### Parameters
constructionSetElementId
    Type: Autodesk.Revit.DB..::..ElementId The construction set ElementId to be checked.
# ### Return Value
True if the construction set ElementId is a valid construction set element, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace